public/programming/gists/c/sdl_window.c.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../gists.html">Gists</a> &gt;
</p>
<div id="outline-container-orgf460780" class="outline-2">
<h2 id="orgf460780">C / sdl_window.c</h2>
<div class="outline-text-2" id="text-orgf460780">
<p>
Create an SDL3 window and poll events.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #989898;">// </span><span style="color: #989898;">SPDX-License-Identifier: MIT
</span><span style="color: #989898;">// </span><span style="color: #989898;">Author: Giovanni Santini
</span><span style="color: #989898;">// </span><span style="color: #989898;">Github: @San7o
</span>
<span style="color: #989898;">// </span><span style="color: #989898;">Create an SDL3 window and poll events
</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;stdio.h&gt;</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;SDL3/SDL_init.h&gt;</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;SDL3/SDL_video.h&gt;</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;SDL3/SDL_error.h&gt;</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;SDL3/SDL_render.h&gt;</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;SDL3/SDL_events.h&gt;</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;SDL3/SDL_keyboard.h&gt;</span>

<span style="color: #ff7f9f;">#define</span> <span style="color: #00d3d0;">WINDOW_NAME</span>   <span style="color: #79a8ff;">"hello world window"</span>
<span style="color: #ff7f9f;">#define</span> <span style="color: #00d3d0;">WINDOW_WIDTH</span>  500
<span style="color: #ff7f9f;">#define</span> <span style="color: #00d3d0;">WINDOW_HEIGHT</span> 500
<span style="color: #ff7f9f;">#define</span> <span style="color: #00d3d0;">WINDOW_FLAGS</span>  0

<span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span>(<span style="color: #6ae4b9;">void</span>)
{
  <span style="color: #b6a0ff;">if</span> (<span style="color: #ff5f59; font-weight: bold;">!</span>SDL_Init(SDL_INIT_VIDEO))
  {
    fprintf(stderr, <span style="color: #79a8ff;">"Error initializing SDL: %s\n"</span>, SDL_GetError());
    <span style="color: #b6a0ff;">return</span> 1;
  }

  <span style="color: #6ae4b9;">SDL_Window</span> *<span style="color: #00d3d0;">window</span>;
  <span style="color: #6ae4b9;">SDL_Renderer</span> *<span style="color: #00d3d0;">renderer</span>;
  <span style="color: #6ae4b9;">SDL_Event</span> <span style="color: #00d3d0;">event</span>;

  <span style="color: #6ae4b9;">bool</span> <span style="color: #00d3d0;">ret</span> = SDL_CreateWindowAndRenderer(WINDOW_NAME, WINDOW_WIDTH,
                                         WINDOW_HEIGHT, WINDOW_FLAGS,
                                         &amp;window, &amp;renderer);
  <span style="color: #b6a0ff;">if</span> (<span style="color: #ff5f59; font-weight: bold;">!</span>ret)
  {
    fprintf(stderr, <span style="color: #79a8ff;">"Error Creating SDL Window: %s\n"</span>, SDL_GetError());
    <span style="color: #b6a0ff;">return</span> 1;
  }

  <span style="color: #b6a0ff;">while</span>(1)
  {  
    <span style="color: #b6a0ff;">if</span> (SDL_PollEvent(&amp;event))
    {
      <span style="color: #b6a0ff;">if</span> (SDL_EVENT_KEY_DOWN == event.type)
      {
        <span style="color: #b6a0ff;">if</span> (event.key.key == <span style="color: #79a8ff;">'q'</span> || event.key.key == SDLK_ESCAPE)
          <span style="color: #b6a0ff;">break</span>;
      }
    }

    SDL_SetRenderDrawColor(renderer, 0, 0, 0, 255);
    <span style="color: #b6a0ff;">if</span> (<span style="color: #ff5f59; font-weight: bold;">!</span>SDL_RenderClear(renderer))
    {
      fprintf(stderr, <span style="color: #79a8ff;">"Error Clearing SDL Window: %s\n"</span>, SDL_GetError());    
      <span style="color: #b6a0ff;">goto</span> <span style="color: #00bcff;">cleanup</span>;
    }
    SDL_SetRenderDrawColor(renderer, 255, 255, 255, 255);

    <span style="color: #989898;">// </span><span style="color: #989898;">Render frame...
</span>
    <span style="color: #b6a0ff;">if</span> (<span style="color: #ff5f59; font-weight: bold;">!</span>SDL_RenderPresent(renderer))
    {
      fprintf(stderr, <span style="color: #79a8ff;">"Error Rendering SDL Window: %s\n"</span>, SDL_GetError());    
      <span style="color: #b6a0ff;">goto</span> <span style="color: #00bcff;">cleanup</span>;
    }
  }

 <span style="color: #00bcff;">cleanup</span>:

  SDL_DestroyRenderer(renderer);
  SDL_DestroyWindow(window);
  SDL_Quit();
  <span style="color: #b6a0ff;">return</span> 0;
}
</pre>
</div>


<hr />

<p>
Travel: <a href="../gists.html">Gists</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
